/**
 * 商城页面使用脚本区域
 * ============================================================================
 * 版权所有 (C)
 * 网站地址:
 * ============================================================================
 * $Version: v1.0.0 Beta $
 * $Author: liwenxuan <liwenxuan@pokpets.com> $
 * $constraint 变量前缀、方法前缀与文件名相同
 * $Date: 2016/12/7 $
 * $Id: b2b2cf.js 2016/12/7  $
**/
var b2b2cf = {
    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 首页分类切换
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author  zhangnan  Date:2016/12/7
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type get
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame Int 必填 goods_type_id 分类id
     *+--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    index_switch_goods_type: function(goods_type_id) {
        $('.b2b2c_nav_level_1').each(function(){
            if($(this).data('id') == goods_type_id){
                $(this).addClass('active');
            }else{
                $(this).removeClass('active');
            }
        });

        b2b2cc.curls('B2b2cPublic/GetGoodsByRecommendMobile', {goods_type_id: goods_type_id}, function(data) {
            if (data.status) {
            	var data = data.data;
            	var html = '';
            	var target = $('#b2b2c_index_main');

            	for (var one = 0; one < data.length; one++) {
            		html += '<section class="b2b2c_product">';
                    if(data[one]['color']){
                        html += '<header style="background-color: '+data[one]['color']+';"><img src="'+data[one]['image'][0]+'" alt=""/>'+data[one]['name']+'</header>';
                    }else{
            		  html += '<header style="background-color: #ea7047;"><img src="'+data[one]['image'][0]+'" alt=""/>'+data[one]['name']+'</header>';
                    }
            		html += '<section class="b2b2c_product_box">';
            		html += '<ul class=clearfix>';

            		var list = data[one]['list'];

            		for (var two = 0; two <list.length; two++) {
            			html += '<li>';
	                    html += '    <a href="'+GV.MODULE_URL+'Index/goodspointinfo/goods_id/'+list[two]['b2b2c_goods_id']+'">';
	                    html += '        <div class="b2b2c_product_imgbox">';
	                    html += '            <img src="'+list[two]['b2b2c_goods_images'][0]+'" alt="">';
	                    html += '        </div>';
	                    html += '        <p class="b2b2c_product_describe toe">'+list[two]['b2b2c_goods_name']+'</p>';
	                    html += '        <div class="b2b2c_price_box">';
	                    html += '            <span class="b2b2c_price fl"><i>&yen</i>'+list[two]['b2b2c_product_price']+'</span>';
	                    html += '            <span class="b2b2c_old_price fr"><i>&yen</i>'+list[two]['b2b2c_product_mktprice']+'</span>';
	                    html += '        </div>';
	                    html += '        <div class="b2b2c_product_btm">';
	                    html += '            <div class="b2b2c_product_logo fl">';
	                    html += '                <img src="'+list[two]['b2b2c_brand_logo'][0]+'" alt="">';
	                    html += '            </div>';
	                    html += '            <div class="b2b2c_product_numbox fr">';
	                    html += '                <div>';
	                    html += '                    <span>已售</span>';
	                    html += '                    <span>'+list[two]['b2b2c_goods_sold_count']+'</span>';
	                    html += '                </div>';
	                    html += '                <div>';
	                    html += '                    <span>评价</span>';
	                    html += '                    <span>'+list[two]['b2b2c_comments_count']+'</span>';
	                    html += '                </div>';
	                    html += '            </div>';
	                    html += '        </div>';
	                    html += '    </a>  ';
            			html += '</li>';
            		}

            		html += '</ul>';
            		html += '</section>';
            		html += '</section>';
            	}

            	target.html(html);

            	$('.b2b2c_two_nav').each(function(){
            		if($(this).data('parentid') == goods_type_id){
                        //不显示没有商品的商品类型          
                        $(this).find('li').each(function(){
                            var found = false;
                            for (var one = 0; one < data.length; one++) {
                                if($(this).data('id') == data[one]['id']){
                                    found = true;
                                }
                            }
                            if(!found){
                                //该分类下没有推荐商品，不显示该分类
                                $(this).remove();
                            }
                        });              

            			$(this).show();
            		}else{
						$(this).hide();
            		}
            	});

            } else {
                b2b2cc.popupdialog(data.info);
            }
        }, 'get');
    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 用户注册手机号码验证
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author zhangnan   Date:2016/12/8
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame String 必填 telno 手机号码
     * +--------------------------------------------------------------------------------------------------------------------
     * @return Boolean
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    user_register_telno: function(telno, type) {
        var returns = false;
        var telnos = b2b2cc.telno(telno);
        if (telnos.success) { //格式正确         
            if (type == true) {
                $('#b2b2c_div_register_error_message').html('');
                $('#b2b2c_div_register_error_message').addClass('b2b2c_register_ture');
                returns = true;
            } else {
                b2b2cc.curls('User/InTelno', {'telno': telno}, function(e) {
                    if (e.status) {
                        $('#b2b2c_div_register_error_message').html('');
                        $('#b2b2c_div_register_error_message').addClass('b2b2c_register_ture');
                        returns = true;
                    } else {
                        $('#b2b2c_div_register_error_message').html(e.info);
                        $('#b2b2c_div_register_error_message').removeClass('b2b2c_register_ture');
                        returns = false;
                    }
                }, 'get', false);
            }
        } else {
            $('#b2b2c_div_register_error_message').html(telnos.info);
            $('#b2b2c_div_register_error_message').removeClass('b2b2c_register_ture');
            returns = false;
        }

        return returns;
    },    
    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 用户手机验证码判断
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author yangjing   Date:2016/7/14
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame String 必填 user_sms_token 接口返回的64位判断KEY
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame String 必填 user_sms_telno 手机号
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame Int 必填 user_sms_code 验证码内容
     * +--------------------------------------------------------------------------------------------------------------------
     * @return Boolean returns 返回的结果
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    user_sms_is: function(user_sms_token, user_sms_telno, user_sms_code) {
        var returns = false;
        if (b2b2cc.isNull(user_sms_code)) {
            $('#b2b2c_div_user_sms_is').text('请输入验证码');
            $('#b2b2c_div_user_sms_is').removeClass('b2b2c_register_ture');
            returns = false;
        } else {
            b2b2cc.curls('User/UserSmsIn', {
                'user_sms_token': user_sms_token,
                'user_sms_telno': user_sms_telno,
                'user_sms_code': user_sms_code
            }, function(e) {
                if (e.status) {
                    $('#b2b2c_div_user_sms_is').text('');
                    $('#b2b2c_div_user_sms_is').addClass('b2b2c_register_ture');
                    returns = true;
                } else {
                    $('#b2b2c_div_user_sms_is').text(e.info);
                    $('#b2b2c_div_user_sms_is').removeClass('b2b2c_register_ture');
                    returns = false;
                }
            }, 'get', false);
        }

        return returns;
    },
    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 判断用户注册密码是否一直
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author yangjing   Date:2016/7/14
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame String 必填 one 密码参数
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame String 必填 two 密码参数
     * +--------------------------------------------------------------------------------------------------------------------
     * @return Boolean returns 返回结果
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    register_passwords_is: function(one, two) {
        var returns = false;
        if (b2b2cc.isNull(one) && b2b2cc.isNull(two)) {
            $('#b2b2c_div_register_error_message').text('请输入密码');
            $('#b2b2c_div_register_error_message').removeClass('b2b2c_register_ture');
            returns = false;
        } else if (one != two) {
            $('#b2b2c_div_register_error_message').text('两次密码不一致');
            $('#b2b2c_div_register_error_message').removeClass('b2b2c_register_ture');
            returns = false;
        } else {
            b2b2cc.curls('User/PasswordIs', {'password': two}, function(e) {
                if (e.status) {
                    $('#b2b2c_div_register_error_message').text('');
                    $('#b2b2c_div_register_error_message').addClass('b2b2c_register_ture');
                    returns = true;
                } else {
                    $('#b2b2c_div_register_error_message').text(e.info);
                    $('#b2b2c_div_register_error_message').removeClass('b2b2c_register_ture');
                    returns = false;
                }
            }, 'get', false);
        }

        return returns;
    },
    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 用户注册提交
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author yangjing   Date:2016/7/16
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame
     * +--------------------------------------------------------------------------------------------------------------------
     * @return Boolean
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    register_submit: function() {
        var telno = $('#b2b2c_telno').val();
        var user_sms_token = $('#b2b2c_hidden_user_sms_token').val();
        var user_sms_code = $('#b2b2c_user_sms_code').val();
        var password_one = $('#b2b2c_password_one').val();
        var password_two = $('#b2b2c_password_two').val();
        if (b2b2cf.user_register_telno(telno) &&
                b2b2cf.user_sms_is(user_sms_token, telno, user_sms_code) &&
                b2b2cf.register_passwords_is(password_one, password_two)) {
            b2b2cc.curls('User/Register', {
                'telno': telno,
                'user_sms_token': user_sms_token,
                'user_sms_code': user_sms_code,
                'password': password_one,
                'repassword': password_two
            }, function(e) {
                $('#button_register_submit').val('请点击提交');
                if (e.status) {
                    b2b2cc.popupdialog('注册成功!', 'Index/login');
                } else {
                    $('#b2b2c_div_register_error_message').text(e.info);
                }
            }, 'post', false);
        } else {
            $('#button_register_submit').val('请点击校验');
        }
    },
    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 用户忘记密码
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author zhangnan   Date:2016/12/8
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame
     * +--------------------------------------------------------------------------------------------------------------------
     * @return Boolean
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    forgetpassword: function() {

        var telno = $('#b2b2c_telno').val();
        var user_sms_token = $('#b2b2c_hidden_user_sms_token').val();
        var user_sms_code = $('#b2b2c_user_sms_code').val();
        var password_one = $('#b2b2c_password_one').val();
        var password_two = $('#b2b2c_password_two').val();

        if (b2b2cf.user_register_telno(telno, true) &&
                b2b2cf.user_sms_is(user_sms_token, telno, user_sms_code) &&
                b2b2cf.register_passwords_is(password_one, password_two)) {
            b2b2cc.curls('User/ForgetUserPassword', {
                'telno': telno,
                'user_sms_token': user_sms_token,
                'user_sms_code': user_sms_code,
                'password': password_one,
                'repassword': password_two
            }, function(e) {
                $('#button_register_submit').val('请点击提交');
                if (e.status) {
                    b2b2cc.popupdialog('修改成功!', 'Index/login');
                } else {
                    $('#b2b2c_div_register_error_message').text(e.info);
                }
            }, 'post', false);
        } else {
            $('#button_register_submit').val('请点击校验');
        }
    },
    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 用户登录
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author yangjing   Date:2016/7/18
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame
     * +--------------------------------------------------------------------------------------------------------------------
     * @return Boolean
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    b2b2c_login: function(telno, password) {
        if (b2b2cc.isNull(telno)) {
            $('#b2b2c_login_button_div').text('请输入用户名');
            setTimeout(function() {
                $('#b2b2c_login_button_div').text('')
            }, 3000);
            return;
        }
        if (b2b2cc.isNull(password)) {
            $('#b2b2c_login_button_div').text('请输入密码');
            setTimeout(function() {
                $('#b2b2c_login_button_div').text('')
            }, 3000);
            return;
        }
        $.post(GV.MODULE_URL + 'Index/login', {'telno': telno, 'password': password}, function(e) {
            if (e.status) {
                b2b2cc.popupdialog('登录成功!', 'Index/index');
            } else {
                $('#b2b2c_login_button_div').text(e.info);
                setTimeout(function() {
                    $('#b2b2c_login_button_div').text('')
                }, 3000);
            }
        }, 'json');
    },
    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 用户手机验证码获取
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author yangjing   Date:2016/7/11
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame String 必填 telno 手机号码
     * +--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    user_sms: function(telno, type) {
        if (b2b2cf.user_register_telno(telno, type)) {
            $('#b2b2c_button_user_sms').removeAttr('onclick');
            b2b2cc.curls('User/UserSms', {'telno': telno}, function(e) {
                if (e.status) {
                    var user_sms_token = e.data.user_sms_token;
                    $('#b2b2c_hidden_user_sms_token').val(user_sms_token);
                    b2b2cc.timemachines(function(e) {
                        $('#b2b2c_button_user_sms').text((e - 1) + 's');
                        if (e == 1) {
                            $('#b2b2c_button_user_sms').text('重新获取');
                            $('#b2b2c_button_user_sms').attr('onclick', 'b2b2cf.user_sms(' + telno + ')');
                        }
                    }, 1, 300);
                } else {
                    $('#b2b2c_div_user_sms_is').text(e.info);
                }
            }, 'get');
        }
    },    

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 个人中心--退出登录
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author zhangnan   Date:2016/12/9
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame 
     * +--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    logout : function(){
        window.location.href = GV.MODULE_URL + 'Index/logout';
    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 个人中心--修改性别
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author zhangnan   Date:2016/12/9
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame 
     * +--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    edit_gender : function(){
        b2b2cf.show_shade();
        $('#b2b2c_div_gender').show();
    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 个人中心--修改性别提交
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author zhangnan   Date:2016/12/9
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame 
     * +--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    edit_gender_post : function(gender){
        $.post(GV.MODULE_URL + 'User/edit_gender', {'gender': gender}, function(e) {
            if (e.status) {
                if(gender == 1){
                    $('#b2b2c_span_gender').text('男');
                }else{
                    $('#b2b2c_span_gender').text('女');
                }
                b2b2cf.hide_shade();
            } else {
                $('#b2b2c_login_button_div').text(e.info);
                setTimeout(function() {
                    $('#b2b2c_login_button_div').text('')
                }, 3000);
            }
        }, 'json');
    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 个人中心--开启遮罩层
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author zhangnan   Date:2016/12/9
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame 
     * +--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    show_shade : function(){
        $('#b2b2c_public_shade').show();
        $('body').addClass('b2b2c_noslide');
    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 个人中心--关闭遮罩层
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author zhangnan   Date:2016/12/9
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame 
     * +--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    hide_shade : function(){
        $('#b2b2c_div_gender').hide();
        $('#b2b2c_public_shade').hide();
        $('body').removeClass('b2b2c_noslide');
    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 个人中心--修改生日点击确定
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author zhangnan   Date:2016/12/10
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame 
     * +--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    mobiscroll_select : function(valueText,inst){
        //valueText是选中的值
        // console.log("valueText : " + valueText);
        //mobiscroll对象
        // console.log("inst : " + inst);
        $('input[name="birthday"]').val(valueText);
        $('#birthday_form').submit();
    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 个人中心--添加收货地址
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author zhangnan   Date:2016/12/10
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame 
     * +--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    add_user_address : function(){
        var post_data = {};
        post_data.name = $('input[name="name"]').val();
        if (b2b2cc.isNull(post_data.name)) {
            b2b2cc.popupdialog('收货人姓名不能为空');
            return false;
        }

        post_data.tel = $('input[name="tel"]').val();
        if (b2b2cc.isNull(post_data.tel)) {
            b2b2cc.popupdialog('手机号码不能为空');
            return false;
        }
        var rs = b2b2cc.telno(post_data.tel);
        if (!rs.success) {
            b2b2cc.popupdialog('手机号码格式不正确');
            return false;
        }

        post_data.area = $('input[name="area_id"]').val();
        if (b2b2cc.isNull(post_data.area)) {
            b2b2cc.popupdialog('地区不能为空');
            return false;
        }

        post_data.address = $('textarea[name="address"]').val();
        if (b2b2cc.isNull(post_data.address)) {
            b2b2cc.popupdialog('地址不能为空');
            return false;
        }

        post_data.zip = $('input[name="zip"]').val();
        if (b2b2cc.isNull(post_data.zip)) {
            b2b2cc.popupdialog('邮政编码不能为空');
            return false;
        }
        if (!b2b2cc.checkZipCode(post_data.zip)) {
            b2b2cc.popupdialog('请正确填写邮政编码');
            return false;
        }

        post_data.is_default = $('input[name="is_default"]').val();

        b2b2cc.show_marsk();
        b2b2cc.curls('B2b2cPrivate/AddressBuyersAdd', post_data, function(data) {
            b2b2cc.close_marsk();
            if (data.status) {
                b2b2cc.popupdialog('添加成功！', 'User/address');
            } else {
                b2b2cc.popupdialog(data.info);
            }
        }, 'post');
    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 个人中心--添加收货地址页面点击设为默认
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author zhangnan   Date:2016/12/10
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame 
     * +--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    add_address_is_default : function(){
        var is_default = $('input[name="is_default"]').val();
        var src = $('input[name="is_default"]').attr('src');
        if(is_default == 1){
            $('input[name="is_default"]').val(0);
            src = src.substring(0, src.length-7) + '030.png';
        }else{
            $('input[name="is_default"]').val(1);
            src = src.substring(0, src.length-7) + '031.png';
        }
        $('input[name="is_default"]').attr('src', src);
    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 个人中心--收货地址列表页面点击设为默认
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author zhangnan   Date:2016/12/10
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type get
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame Int 必填 user_address_id  收货地址id
     *+--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    set_default_address: function(user_address_id) {
        b2b2cc.popupdialoghtml('是否设为默认地址', function() {
            b2b2cc.curls('B2b2cPrivate/SetUserDefaultAddress', {user_address_id: user_address_id}, function(data) {
                if (data.status) {
                    b2b2cc.popupdialog('设置成功！');
                    window.location.reload();
                } else {
                    b2b2cc.popupdialog(data.info);
                }
            }, 'get');
        });
    },    

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 删除买家收货地址
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author zhangnan   Date:2016/12/10
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     *+--------------------------------------------------------------------------------------------------------------------
     * @parame   Int         必填  $user_address_id    买家收货地址ID
     * +--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    address_buyers_delete: function(user_address_id) {
        var user_address = {};
        user_address.user_address_id = user_address_id;
        user_address.user_id = 0;
        b2b2cc.popupdialoghtml('是否删除', function() {
            b2b2cc.curls('B2b2cPrivate/AddressBuyersDelete', user_address, function(data) {
                if (data.status) {
                    b2b2cc.popupdialog('删除成功！');
                    window.location.reload();
                } else {
                    b2b2cc.popupdialog(data.info);
                }
            }, 'get');
        });
    },    
    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 收藏夹取消收藏
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author yangjing   Date:2016/12/10
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type GET
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame Int 必填 $goods_id 商品ID
     *+--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    cancel_collect_goods: function(b2b2c_favorite_id) {
        if (b2b2cc.isNull(b2b2c_favorite_id)) {
            b2b2cc.popupdialog('取消失败');
            return false;
        }
        b2b2cc.curls('B2b2cPrivate/FavoriteGoodsDelete', {b2b2c_favorite_id: b2b2c_favorite_id}, function(data) {
            if (data.status) {
                b2b2cc.popupdialog('取消成功', 'User/collect');
            } else {
                b2b2cc.popupdialog(data.info);
            }
        }, 'get');
    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 订单管理订单状态切换
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author  zhangnan  Date:2016/12/23
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type get
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame Object 必填 thisObj 选中的菜单项
     *+--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    order_manage_switch_order_status: function(thisObj) {
        if(switching_order_status){
            return false;
        }
        switching_order_status = true;
        $('.dropload-down').remove();
        $('.b2b2c_mage_order_con').html('');

        $('.b2b2c_mage_order li').each(function(){
            if($(this).data('status') == $(thisObj).data('status')){
                $(this).addClass('active');
            }else{
                $(this).removeClass('active');
            }
        });

        var get_data = {};
        get_data.terminal_type = 2;
        var last_order_index = 0;
        get_data.last_order_index = last_order_index;
        get_data.status = $(thisObj).data('status');

        b2b2cc.curls('B2b2cPrivate/GetOrderList', get_data, function(data) {
            if(data.status){
                var data = data.data.list;
                var html = "";

                dropload = $('.dropload_content').dropload({
                    scrollArea : window,
                    domUp : {
                        domClass   : 'dropload-up',
                        domRefresh : '<div class="dropload-refresh">↓下拉刷新</div>',
                        domUpdate  : '<div class="dropload-update">↑释放更新</div>',
                        domLoad    : '<div class="dropload-load"><span class="loading"></span>加载中...</div>'
                    },
                    domDown : {
                        domClass   : 'dropload-down',
                        domRefresh : '<div class="dropload-refresh">↑上拉加载更多</div>',
                        domLoad    : '<div class="dropload-load"><span class="loading"></span>加载中...</div>',
                        domNoData  : '<div class="dropload-noData">暂无更多数据</div>'
                    },
                    loadUpFn : function(me){
                        var get_data = {};
                        get_data.terminal_type = 2;
                        var last_order_index = 0;
                        get_data.last_order_index = last_order_index;
                        get_data.status = $('.b2b2c_mage_order li.active').eq(0).data('status');

                        b2b2cc.curls('B2b2cPrivate/GetOrderList', get_data, function(data) {
                            if(data.status){
                                var data = data.data.list;
                                var html = "";
                                if(data.length > 0){
                                    html = b2b2cf.order_manage_make_list_html(data, last_order_index);
                                }

                                $('.b2b2c_mage_order_con').html(html);
                                me.resetload();
                                me.unlock();
                                me.noData(false);
                            }

                        }, 'get');
                    },
                    loadDownFn : function(me){
                        var get_data = {};
                        get_data.terminal_type = 2;

                        var last_order_index = $('.b2b2c_mage_order_inner:last').data('index');
                        get_data.last_order_index = last_order_index;
                        get_data.status = $('.b2b2c_mage_order li.active').eq(0).data('status');

                        b2b2cc.curls('B2b2cPrivate/GetOrderList', get_data, function(data) {
                            if(data.status){
                                var data = data.data.list;
                                var html = "";
                                if(data.length > 0){
                                    html = b2b2cf.order_manage_make_list_html(data, last_order_index);
                                }else{
                                    // 锁定
                                    me.lock();
                                    // 无数据
                                    me.noData();
                                }

                                $('.b2b2c_mage_order_con').append(html);
                                me.resetload();
                            
                                switching_order_status = false;

                            }

                        }, 'get');
                    },
                    threshold : 50
                });

                // if(data.length > 0){
                //     html = b2b2cf.order_manage_make_list_html(data, last_order_index);
                // }else{
                //     // 锁定
                //     dropload.lock();
                //     // 无数据
                //     dropload.noData();
                // }
                // $('.b2b2c_mage_order_con').html(html);
                // dropload.direction = 'up';
                // dropload.resetload();
            }

        }, 'get');
    },    

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 订单管理拼接订单列表html
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author  zhangnan  Date:2016/12/23
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type get
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame Object 必填 data 后台返回的数据
     *+--------------------------------------------------------------------------------------------------------------------
     * @parame Int 必填 last_order_index 页面上最后一个订单的序号(不是订单ID)
     *+--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    order_manage_make_list_html : function(data,last_order_index){
        var html = "";
        for (var one = 0; one < data.length; one++) {
            last_order_index++;
            html += '<section class="b2b2c_mage_order_inner" data-index="'+last_order_index+'">';
            html += '    <div class="b2b2c_order_inner_t bgcf b2b2c_p16 clearfix">';
            html += '        <span class="b2b2c_shop_name fl toe">'+data[one]['shop_name']+'</span>';
            html += '        <span class="b2b2c_shop_state fr tr">';
            html += data[one]['order_status_str'];
            html += '        </span>';
            html += '    </div>';
            html += '    <div class="b2b2c_order_inner_c">';
            html += '        <div class="b2b2c_product bgcf">';
            html += '            <ul>';
            html += '                <!-- 商品内容一start-->';

            var list = data[one]['product_list'];
            for (var two = 0; two < list.length; two++) {
                html += '<li class="clearfix">';
                html += '    <div class="b2b2c_div clearfix" onclick=\'window.location.href="'+GV.MODULE_URL+'User/orderdetailbuyers/order_id/'+list[two]['id']+'"\'>';
                html += '        <div class="b2b2c_imgbox fl">';
                html += '            <a href="javascript:void(0);">';
                html += '            <img src="'+list[two]['oi_image'][0]+'" alt=""></a>';
                html += '        </div>';
                html += '        <div class="b2b2c_product_txt fl">';
                html += '            <h3>'+list[two]['oi_name']+'</h3>';
                html += '            <p class="clearfix">';
                html += '            <span class="fl">';
                html += '                <i>&yen</i>';
                html += '                <i>'+list[two]['oi_price']+'</i>';
                html += '                <i>&times;</i>';
                html += '                <i>'+list[two]['oi_count']+'</i>';
                html += '            </span>';
                html += '            <span class="fr">';
                html += '                 <i>&yen</i>';
                html += '                <i>'+list[two]['oi_sum']+'</i>';
                html += '            </span>';
                html += '            </p>';
                html += '        </div>';
                html += '    </div>';
                html += '    <div class="b2b2c_succeed_after_box clearfix">';

                if(list[two]['has_comment_button']){
                    html += '<a class="fr" href="'+GV.MODULE_URL+'User/buyermakeorderrated/order_id/'+list[two]['id']+'/product_id/'+list[two]['product_id']+'">评价</a>';
                }

                if(list[two]['has_aftersale_apply_button']){
                    html += '<a class="fr" href="javascript:void(0);" onclick="b2b2cf.order_manage_aftersale_apply()">申请售后</a>';
                }

                html += '    </div>';
                html += '</li>';
            };


            html += '                <!--商品内容一end-->';
            html += '            </ul>';
            html += '        </div>';
            html += '        <div class="b2b2c_payment_box bgcf b2b2c_p16 clearfix">';
            html += '            <div class="b2b2c_payment fr">';
            html += '                <span>实付:&yen</span>';
            html += '                <span class="b2b2c_price">'+data[one]['sum']+'</span>';
            html += '                <span>(含运费<i>&yen</i><i>'+data[one]['order_shipping_fee']+'</i>)</span>';
            html += '            </div>';
            html += '        </div>';
            html += '    </div>';
            html += '    <div class="b2b2c_order_inner_b bgcf clearfix">';

            if(data[one]['has_pay_button']){
                html += '<a href="'+GV.MODULE_URL+'Pay/applypay/sn/'+data[one]['order_sn']+'" class="fr">立即付款</a>';
            }

            if(data[one]['has_refund_apply_button']){
                html += '<a href="javascript:void(0);" class="fr" onclick="b2b2cf.apply_order_refund('+data[one]['id']+')">申请退款</a>';
            }

            if(data[one]['has_logi_button']){
                html += '<a href="javascript:void(0);" class="fl" onclick="b2b2cf.get_order_logistics_detail('+data[one]['id']+')">物流信息</a>';
            }

            if(data[one]['has_take_goods_button']){
                html += '<a href="javascript:void(0);" class="fr" onclick="b2b2cf.make_order_sure('+data[one]['id']+')">点击收货</a>';
            }

            html += '    </div>';
            html += '</section>';                    
        };

        return html;
    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 订单管理点击申请售后
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author  zhangnan  Date:2016/12/30
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type get
     * +--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    order_manage_aftersale_apply : function(){
        b2b2cc.popupdialog('请到博宠商城PC版申请售后，网址：www.pokpets.com');
    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 查看订单物流详情
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author zhangnan   Date:2016/12/30
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type 
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame Int 必填 order_id 订单ID
     *+--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
     **/
    get_order_logistics_detail: function(order_id) {
        b2b2cc.curls('B2b2cPrivate/GetOrderDelivery', {order_id: order_id}, function(data) {
            if (data.status) {
                var data = data.data;
                var html = '<div class="">';
                html += '<div class="b2b2c_order_await_message_logistics-popping" style="display:block">';
                html += '<div class="b2b2c_order_await_message_logistics-popping-top">';
                html += '<p class="fl">物流信息</p>';
                html += '<div class="b2b2c_order_await_message_logistics-popping-user fr">';
                //html += '用户名：<span>' + name + '</span>';
                html += '</div>';
                html += '</div>';
                if (data.length > 0) {
                    for (var i in data) {
                        html += '<div class="b2b2c_order_await_message_logistics-popping-btm">';
                        html += '<div class="b2b2c_order_await_message_logistics-popping-logistics-number">';
                        html += '<div class="b2b2c_order_await_message_logistics-popping-logistics-numleft">';
                        html += '物流编号：<span>' + data[i]['key'] + '</span>';
                        html += '</div>';
                        html += '<p class="">' + data[i]['name'] + '</p>';
                        html += '</div>';
                        html += '</div>';
                    }
                } else {
                    html += '<span>无法查询到物流信息</span>';
                }
                html += '<div style="padding:1rem;cursor:pointer" class = "b2b2c_order_await_message_logistics-popping-close text-center" id = "b2b2c_order_logistics-close" >关闭</div>';
                html += '</div>';
                html += '</div>';
                var d = dialog({
                    id: 'logis_show_dialog',
                    lock: true,
                    opacity: 1,
                    content: html
                })
                d.showModal();
                $('body').on('click', '.b2b2c_order_await_message_logistics-popping-close', function() {
                    dialog.get('logis_show_dialog').close();
                })
            } else {

            }
        }, 'get');
    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 商品列表拼接商品列表html
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author  zhangnan  Date:2016/12/25
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type get
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame Object 必填 data 后台返回的数据
     *+--------------------------------------------------------------------------------------------------------------------
     * @parame Int 必填 last_goods_index 页面上最后一个商品的序号(不是商品ID)
     *+--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    goods_list_make_list_html : function(data,last_goods_index){
        var html = "";
        for (var one = 0; one < data.length; one++) {
            last_goods_index++;
                html += '<div class="b2b2c_pro_list_mid bgcf clearfix"  data-index="'+last_goods_index+'" onclick="window.location.href = \''+GV.MODULE_URL+'Index/goodspointinfo/goods_id/'+data[one]['id']+'\'">';
                html += '    <div class="img_box fl">';
                html += '        <img src="'+data[one]['images'][0]+'" alt=""/>';
                html += '    </div>';
                html += '    <div class="b2b2c_info_box fl">';
                html += '        <p class="toe">'+data[one]['name']+'</p>';
                html += '        <div class="b2b2c_info_box_b clearfix">';
                html += '            <div class="fl b2b2c_info_box_l">';
                html += '                <span>&yen;<i>'+data[one]['product_mktprice']+'</i></span>';
                html += '                <span>&yen;<i>'+data[one]['product_price']+'</i></span>';
                html += '            </div>';
                html += '            <div class="fr b2b2c_info_box_r">';
                html += '                <div class="clearfix">';
                html += '                    <img class="fr" src="'+data[one]['brand_logo'][0]+'" alt=""/>';
                html += '                </div>';
                html += '                <span>已售 <i>'+data[one]['sold_count']+'</i></span>';
                html += '                <span>评论 <i>'+data[one]['comments_count']+'</i></span>';
                html += '            </div>';
                html += '        </div>';
                html += '    </div>';
                html += '</div>';
        }
        return html;
    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 商品列表显示或隐藏选择商品一级分类的菜单
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author  zhangnan  Date:2016/12/24
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type get
     * +--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    goods_list_type_level_1_menu : function(){
        if($('#b2b2c_list_searlist').is(':hidden')){
            $('#b2b2c_list_searlist').show();
        }else{
            $('#b2b2c_list_searlist').hide();
        }
    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 商品列表显示或隐藏选择商品二级分类的菜单
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author  zhangnan  Date:2016/12/24
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type get
     * +--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    goods_list_type_level_2_menu : function(){
        if($('#b2b2c_goods_list_type_level_2_section').is(':hidden')){
            //获取商品二级分类的数据

            if($('#b2b2c_goods_list_type_level_2_ul').is(':has(li)') == 0){
                var get_data = {};
                get_data.parentid = $('#b2b2c_goods_list_type_level_1').val();
                b2b2cc.curls('B2b2cPublic/GetGoodsTypeChildren', get_data, function(data) {
                    if(data.status){
                        var data = data.data;
                        var html = "";
                        if(data.length > 0){
                            var type_level_2 = $('#b2b2c_goods_list_type_level_2').val();
                            html = b2b2cf.goods_list_make_type_level_2_menu_html(data, type_level_2);
                            $('#b2b2c_goods_list_type_level_2_ul').append(html);

                            //如果有默认选中的二级分类，且不是全部，就要获取三级分类的数据
                            if($('#b2b2c_goods_list_type_level_2_ul li.active').length > 0){
                                var type_level_2 = $('#b2b2c_goods_list_type_level_2_ul li.active').eq(0).data('id');
                                if(type_level_2 > 0){
                                    b2b2cf.goods_list_type_level_3_menu($('#b2b2c_goods_list_type_level_2_ul li.active').eq(0), true);
                                }
                            }
                        }

                        $('#b2b2c_goods_list_type_level_2_section').show();
                    }

                }, 'get');
            }else{
                $('#b2b2c_goods_list_type_level_2_section').show();
            }

        }else{
            $('#b2b2c_goods_list_type_level_2_section').hide();
        }
    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 商品列表显示或隐藏选择商品三级分类的菜单
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author  zhangnan  Date:2016/12/24
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type get
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame Object 必填 thisObj 点击的商品二级分类
     *+--------------------------------------------------------------------------------------------------------------------
     * @parame boolean 非必 ignore_active 无视选中状态
     *+--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    goods_list_type_level_3_menu : function(thisObj, ignore_active){
        var parentid = $(thisObj).data('id');

        if(($(thisObj).hasClass('active') == false) || ignore_active){
            if(parentid == 0){
                //选择的是全部，刷新页面
                $('#b2b2c_goods_list_type_level_2').val(0);
                $('#b2b2c_goods_list_type_level_3').val(0);
                $('#b2b2c_goods_list_type_level_2_section').hide();
                b2b2cf.goods_list_search();
                return;
            }else{
                $('#b2b2c_goods_list_type_level_2').val(parentid);
                if(!ignore_active){
                    $(thisObj).addClass('active').siblings('li').removeClass('active');
                }
            }

            //获取商品三级分类的数据
            var get_data = {};
            get_data.parentid = parentid;
            b2b2cc.curls('B2b2cPublic/GetGoodsTypeChildren', get_data, function(data) {
                if(data.status){
                    var data = data.data;
                    var html = "";
                    if(data.length > 0){
                        var type_level_3 = $('#b2b2c_goods_list_type_level_3').val();
                        html = b2b2cf.goods_list_make_type_level_3_menu_html(data, type_level_3);
                    }else{

                    }

                    $('#b2b2c_goods_list_type_level_3_ul').empty().append(html);

                    $('#b2b2c_goods_list_type_level_3_nav').show();
                }

            }, 'get');

        }else{
            if(parentid == 0){
                //选择的是全部，收起菜单
                $('#b2b2c_goods_list_type_level_2_section').hide();
            }else{
                $(thisObj).removeClass('active');
                $('#b2b2c_goods_list_type_level_3_nav').hide();
                $('#b2b2c_goods_list_type_level_3_ul').empty();
            }
        }
    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 商品列表拼接商品二级分类菜单html
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author  zhangnan  Date:2016/12/24
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type get
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame Object 必填 data 后台返回的数据
     *+--------------------------------------------------------------------------------------------------------------------
     * @parame Int 非必 type_level_2 默认选择的二级分类ID
     *+--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    goods_list_make_type_level_2_menu_html : function(data, type_level_2){
        var html = '';
        for (var one = 0; one < data.length; one++) {
            if(data[one]['id'] == type_level_2){
                html += '<li class="tc fl bgcf active" data-id="'+data[one]['id']+'" onclick="b2b2cf.goods_list_type_level_3_menu(this)">'+data[one]['name']+'</li>';
            }else{
                html += '<li class="tc fl bgcf" data-id="'+data[one]['id']+'" onclick="b2b2cf.goods_list_type_level_3_menu(this)">'+data[one]['name']+'</li>';
            }
        };

        if(type_level_2 == 0){
            html += '<li class="tc fl bgcf active" data-id="0" onclick="b2b2cf.goods_list_type_level_3_menu(this)">全部</li>';
        }else{
            html += '<li class="tc fl bgcf" data-id="0" onclick="b2b2cf.goods_list_type_level_3_menu(this)">全部</li>';
        }

        return html;
    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 商品列表拼接商品三级分类菜单html
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author  zhangnan  Date:2016/12/24
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type get
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame Object 必填 data 后台返回的数据
     *+--------------------------------------------------------------------------------------------------------------------
     * @parame Int 非必 type_level_2 默认选择的三级分类ID
     *+--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    goods_list_make_type_level_3_menu_html : function(data, type_level_3){
        var html = '';
        for (var one = 0; one < data.length; one++) {
            if(data[one]['id'] == type_level_3){
                html += '<li class="tc fl bgcf active" data-id="'+data[one]['id']+'" onclick="b2b2cf.goods_list_type_level_3_select(this)">'+data[one]['name']+'</li>';
            }else{
                html += '<li class="tc fl bgcf" data-id="'+data[one]['id']+'" onclick="b2b2cf.goods_list_type_level_3_select(this)">'+data[one]['name']+'</li>';
            }
        };

        if(type_level_3 == 0){
            html += '<li class="tc fl bgcf active" data-id="0" onclick="b2b2cf.goods_list_type_level_3_select(this)">全部</li>';
        }else{
            html += '<li class="tc fl bgcf" data-id="0" onclick="b2b2cf.goods_list_type_level_3_select(this)">全部</li>';
        }

        return html;
    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 商品列表选择商品三级分类
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author  zhangnan  Date:2016/12/24
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type get
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame Object 必填 thisObj 选择的商品三级分类
     *+--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    goods_list_type_level_3_select : function(thisObj){
        var parentid = $(thisObj).data('id');

        if($(thisObj).hasClass('active') == false){
            $('#b2b2c_goods_list_type_level_3').val(parentid);
            b2b2cf.goods_list_search();
        }
    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 商品列表显示筛选条件
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author  zhangnan  Date:2016/12/24
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type get
     * +--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    goods_list_filter_show : function(){
        $('.b2b2c_public_shade').show();
        $('.b2b2c_list_choose').show();
    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 商品列表搜索
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author  zhangnan  Date:2016/12/24
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type get
     * +--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    goods_list_search : function(){
        var url = GV.MODULE_URL + 'Index/goods_list';

        var type = $('#b2b2c_goods_list_type_level_1').val();
        var type_level_2 = $('#b2b2c_goods_list_type_level_2').val();
        var type_level_3 = $('#b2b2c_goods_list_type_level_3').val();
        var goods_keyword = $('#b2b2c_goods_list_keyword').val();
        var sort = $('#b2b2c_goods_list_sort').val();

        var is_import = $('.b2b2c_import_filter_ul li.active').data('import');
        var price_from = $('.b2b2c_price_filter_ul li.active').data('from');
        var price_to = $('.b2b2c_price_filter_ul li.active').data('to');
        var brand_id = $('.b2b2c_brand_filter_ul li.active').data('id');


        if (!b2b2cc.isNull(type)) {
            url += '/type/' + type;
        }

        if (!b2b2cc.isNull(type_level_2) && type_level_2 != '0') {
            url += '/type_level_2/' + type_level_2;
        }

        if (!b2b2cc.isNull(type_level_3) && type_level_3 != '0') {
            url += '/type_level_3/' + type_level_3;
        }

        if(is_import != null){
            url += '/is_import/' + is_import;
        }

        if (!b2b2cc.isNull(price_from)) {
            url += '/price_from/' + price_from;
        }

        if (!b2b2cc.isNull(price_to)) {
            url += '/price_to/' + price_to;
        }

        if (!b2b2cc.isNull(brand_id)) {
            url += '/brand_id/' + brand_id;
        }

        if (!b2b2cc.isNull(goods_keyword)) {
            url += '/goods_keyword/' + goods_keyword;
        }

        if (!b2b2cc.isNull(sort)) {
            url += '/sort/' + sort;
        }

        url += '/v/1';

        window.location.href = url;
    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 购物车，点击商品跳转到商品详情
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author  zhangnan  Date:2017/1/6
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type get
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame Int 必填 goods_id 商品ID
     *+--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    cart_jump_to_goods_info : function(goods_id){
        window.location.href = GV.MODULE_URL + 'Index/goodspointinfo/goods_id/' + goods_id;
    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 订单确认页，没有收货地址时点击提交订单
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author  zhangnan  Date:2017/1/6
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type get
     * +--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    no_default_address : function(){
        b2b2cc.popupdialog('请添加收货地址');
        window.location.href=GV.MODULE_URL+'user/address';
    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 首页搜索
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author  zhangnan  Date:2017/1/3
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type get
     * +--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    index_search : function(){
        var keyword = $('.b2b2c_header input[name="keyword"]').val();
        window.location.href = GV.MODULE_URL + 'Index/goods_list/goods_keyword/' + keyword + '/v/1'
    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 商品列表排序
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author  zhangnan  Date:2016/12/24
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type get
     * +--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    goods_list_sort : function(sort){
        $('#b2b2c_goods_list_sort').val(sort);
        b2b2cf.goods_list_search();
    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 商品列表选择筛选条件，单选
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author  zhangnan  Date:2016/12/24
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type get
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame Object 必填 thisObj 选中的筛选条件
     *+--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    goods_list_filter_select_simple : function(thisObj){
        if($(thisObj).hasClass('active')){
            $(thisObj).removeClass('active');
        }else{
            $(thisObj).siblings('li').removeClass('active');
            $(thisObj).addClass('active');
        }
    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 商品列表选择筛选条件，多选
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author  zhangnan  Date:2016/12/24
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type get
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame Object 必填 thisObj 选中的筛选条件
     *+--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    goods_list_filter_select_multiple : function(thisObj){
        if($(thisObj).hasClass('active')){
            $(thisObj).removeClass('active');
        }else{
            $(thisObj).addClass('active');
        }
    },
	
    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 商品详情切换页面
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author  zhangnan  Date:2016/12/25
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type get
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame Object 必填 thisObj 选中的页面
     *+--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    goods_info_switch : function(thisObj){
        $(thisObj).addClass('active').siblings('a').removeClass('active');
        $('#b2b2c_goods_info_outer').children('div').each(function(){
            if($(this).attr('id') == $(thisObj).data('div')){
                $(this).show();
            }else{
                $(this).hide();
            }
        });
        $('#b2b2c_goods_info_outer').children('#b2b2c_goods_info_comment_div').css({ position: "absolute", top: "4.8rem"});
        $('#b2b2c_goods_info_outer').children('#b2b2c_goods_info_detail_div').css({ position: "absolute", top: "4.8rem"});
    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 商品详情立即购买
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author  zhangnan  Date:2016/12/26
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type get
     * +--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    goods_info_buy : function(){
        var product_id = $('#b2b2c_goods_info_product_id').val();
        var product_count = 1;
        var url = GV.MODULE_URL + 'User/order_confirm_goodsdetail/product_id/' + product_id + '/product_count/' + product_count;
        window.location.href = url;
    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 收藏商品
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author zhangnan   Date:2016/12/26
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type GET
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame Int 必填 $goods_id 商品ID
     *+--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    goodstypelist_addfavorite: function(goods_id) {
        b2b2cc.show_marsk();
        var post_data = {};
        post_data.goods_id = goods_id;
        b2b2cc.curls('B2b2cPrivate/Favorite', post_data, function(data) {
            b2b2cc.close_marsk();
            if (data.status) {
                $('#b2b2c_public_goods_addcollect').attr('onclick', '');
                $('#b2b2c_public_goods_addcollect').addClass('already_f');
                b2b2cc.popupdialog('收藏成功！');
            } else {
                if (data.code == 10003) {
                    b2b2cc.popupdialog('请先登录', "Index/login");
                } else {
                    b2b2cc.popupdialog(data.info);
                }
            }
        }, 'get');
    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 详情页地区选择
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author wangdi Date:2016/8/23
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     *+--------------------------------------------------------------------------------------------------------------------
     * @parame String 必填obj,e
     *+--------------------------------------------------------------------------------------------------------------------
     * @parame String 选填样式(class="_citys0" 省，class="_citys1"市，class="_citys2"区)
     *+--------------------------------------------------------------------------------------------------------------------
     * @return String 选填地区id id="_citys0"省，id="_citys1"市，id="_citys2"区
     *+--------------------------------------------------------------------------------------------------------------------
    **/
    SelCity: function(obj, e, callback) {
        var area_data = areas.area_data;
        var Iput = {
            confg: {
                hand: "0", //0对像位置1鼠标位置divID滚动位置
                idIframe: "PoPx", //默认可不用改
                idBox: "PoPy", //默认可不用改
                content: "", //传过来的内容
                ok: null, //弹出框之后执行的函数
                id: null, //不能为空一般传this对像而不是对像ID
                event: window.event, //这个必写一般为e就可以了
                top: 0, //顶部偏移位置
                left: 0, //左部偏移位置
                bodyHeight: 0, //在被position:absolute元素下得到HTML真实高度
                bodyWidth: 0,
                width: 0,
                soll: null,
                pop: null //指定ID点击时不关闭
            },
            get: function(obj) {
                return document.getElementById(obj);
            },
            lft: function(e) {
                var l = 0;
                while (e) {
                    l += e.offsetLeft;
                    e = e.offsetParent;
                }
                return l
            },
            ltp: function(e) {
                var t = 0;
                while (e) {
                    t += e.offsetTop;
                    e = e.offsetParent;
                }
                return t
            },
            clear: function() {
                Iput.confg.hand = "0";
                Iput.confg.ok = null;
                Iput.confg.top = 0;
                Iput.confg.left = 0;
                Iput.confg.bodyHeight = 0;
                Iput.confg.bodyWidth = 0;
                Iput.confg.width = 0;
                Iput.confg.pop = null;
            },
            stopBubble: function(e) {
                if (e && e.stopPropagation) {
                    e.stopPropagation();    //w3c
                } else {
                    window.event.cancelBubble = true; //IE
                }
            },
            pop: function() {
                var $a = document.getElementsByTagName("body").item(0);
                var $c = document.createElement("iframe");
                var $b = document.createElement("div");
                $c.setAttribute('id', Iput.confg.idIframe);
                $c.setAttribute("src", "about:blank");
                $c.style.zindex = '100';
                $c.frameBorder = "0";
                $c.style.width = "0px";
                $c.style.height = "0px";
                $c.style.position = 'absolute';
                $b.setAttribute('id', Iput.confg.idBox);
                $b.setAttribute('align', 'left');
                $b.style.position = 'absolute';
                $b.style.background = '#fff';
                $b.style.zIndex = '20000';
                $b.style.height = document.body.offsetHeight + "px";
                if ($a) {
                    if (Iput.get(Iput.confg.idIframe)) {
                        Iput.colse();
                    }
                    $a.appendChild($c);
                    if ($c) {
                        $c.ownerDocument.body.appendChild($b);
                    }
                    Iput.get(Iput.confg.idBox).innerHTML = Iput.confg.content;
                    Iput.drice(Iput.confg.event);
                }

                if (!document.all) {
                    window.document.addEventListener("click", Iput.hide, false);
                }
                else {
                    window.document.attachEvent("onclick", Iput.hide);
                }
            },
            drice: function(e) {
                var bodyHith = Iput.confg.bodyHeight == 0 ? document.body.scrollHeight : Iput.confg.bodyHeight;
                var bodywidth = Iput.confg.bodyWidth == 0 ? document.body.scrollWidth : Iput.confg.bodyWidth;
                if (!e)
                    e = window.event;
                var top = 0, left = 0;
                var a = Iput.get(Iput.confg.idBox);
                var b = Iput.get(Iput.confg.idIframe);
                var c = Iput.confg.id.offsetHeight;
                var d = Iput.confg.id.offsetWidth;
                var w = 0;
                var st = 0;
                var sl = 0;
                if (Iput.confg.soll != null) {
                    st = document.getElementById(Iput.confg.soll).scrollTop;
                    sl = document.getElementById(Iput.confg.soll).scrollLeft;
                }
                if (Iput.get(Iput.confg.idIframe)) {
                    if (Iput.confg.hand == "1") {
                        top = Iput.confg.top + document.body.scrollTop + document.documentElement.scrollTop + e.clientY;
                        left = Iput.confg.left + e.clientX + document.body.scrollLeft + document.documentElement.scrollLeft;
                        if (a.offsetHeight + top > bodyHith) {
                            top = top - a.offsetHeight + Iput.get(Iput.confg.idBox).firstChild.offsetHeight;
                        }
                        if (a.offsetWidth + left > bodywidth) {
                            left = left - a.offsetWidth + Iput.get(Iput.confg.idBox).firstChild.offsetWidth;
                        }
                        a.style.top = 0;
                        // a.style.top = top - st + "px";
                        b.style.top = top - st + "px";
                        a.style.left = 0;
                        b.style.left = left - sl + "px";
                    }
                    else if (Iput.confg.hand == "0") {
                        w = Iput.confg.id.offsetWidth + "px";
                        n = document.body.offsetWidth + "px";
                        a.style.width = n;
                        b.style.width = w;
                        height = c;
                        top = Iput.confg.top + Iput.ltp(Iput.confg.id);
                        left = Iput.confg.left + Iput.lft(Iput.confg.id);
                        if (a.firstChild.offsetHeight + top + c > bodyHith) {
                            top = top - a.firstChild.offsetHeight - c;
                        }
                        if (a.firstChild.offsetWidth + left > bodywidth) {
                            left = left - a.firstChild.offsetWidth + d;
                        }
                        b.style.top = top - st + "px";
                        a.style.top = 0;
                        b.style.left = left - sl + "px";
                        a.style.left = 0;
                    }
                    else {
                        height = c;
                        top = Iput.confg.top - Iput.get(Iput.confg.hand).scrollTop + Iput.ltp(Iput.confg.id);
                        left = Iput.confg.left - Iput.get(Iput.confg.hand).scrollLeft + Iput.lft(Iput.confg.id);

                        if (a.offsetHeight + top > bodyHith) {
                            top = top - a.offsetHeight - c;
                        }
                        if (a.offsetWidth + left > bodywidth) {
                            left = left - a.offsetWidth - d;
                        }

                        b.style.top = top - st + height + "px";
                        a.style.top = 0;
                        // a.style.top = top - st + height + "px";
                        b.style.left = left - sl + "px";
                        // a.style.left = left - sl + "px";
                        a.style.left = 0;
                    }
                }
            },
            show: function() {
                var config = arguments[0];
                var that = Iput.confg;
                Iput.clear();
                for (var i in that) {
                    if (config[i] != undefined) {
                        that[i] = config[i];
                    }
                }
                ;
                Iput.pop();
                if (Iput.confg.ok != null) {
                    Iput.action(Iput.confg.ok());
                }
            },
            colse: function() {
                if (Iput.get(Iput.confg.idIframe)) {
                    document.body.removeChild(Iput.get(Iput.confg.idBox));
                    document.body.removeChild(Iput.get(Iput.confg.idIframe));
                }
                if (Iput.get(Iput.confg.pop)) {
                    Iput.get(Iput.confg.pop).style.display = "none";
                }
            },
            hide: function(e) {//点击任何处关闭层
                e = window.event || e;
                var srcElement = e.srcElement || e.target;
                if (Iput.confg.event == undefined) {//输入时用,般在没传入Iput.confg.event请况下使用
                    Iput.colse();
                }
                else {
                    var a = Iput.confg.event.srcElement || Iput.confg.event.target;
                    var b = Iput.get(Iput.confg.pop);
                    if (a != srcElement) {
                        Iput.colse();
                    }
                    if (b != null) {
                        if (b != srcElement && a != srcElement) {
                            Iput.colse();
                        }
                    }
                }
                if (Iput.get(Iput.confg.idIframe)) {
                    Iput.get(Iput.confg.idIframe).onclick = function(e) {
                        Iput.stopBubble(e);
                    };
                    Iput.get(Iput.confg.idBox).onclick = function(e) {
                        Iput.stopBubble(e);
                    };
                }
                if (Iput.get(Iput.confg.pop)) {
                    Iput.get(Iput.confg.pop).onclick = function(e) {
                        Iput.stopBubble(e);
                    };
                }

            },
            action: function(obj) {
                eval(obj);
            },
            cookie: {
                Set: function(name, val) {
                    var Days = 30;                          //此 cookie 将被保存 30 天
                    var exp = new Date();                  //new Date("December 31, 9998");
                    exp.setTime(exp.getTime() + Days * 24 * 60 * 60 * 1000);
                    document.cookie = name + "=" + escape(val) + ";expires=" + exp.toGMTString() + "; path=/";
                },
                Get: function(name) {
                    var start = document.cookie.indexOf(name);
                    var end = document.cookie.indexOf(";", start);
                    return start == -1 ? null : unescape(document.cookie.substring(start + name.length + 1, (end > start ? end : document.cookie.length)));
                },
                Del: function(name) {
                    var exp = new Date();
                    exp.setTime(exp.getTime() - 1);
                    var cval = this.GetCookie(name);
                    if (cval != null)
                        document.cookie = name + "=" + cval + ";expires=" + exp.toGMTString();
                }
            },
            ischeck: function(bol) {
                var objs = form1.getElementsByTagName("input");
                if (bol) {
                    for (var i = 0; i < objs.length; i++) {
                        if (objs[i].type.toLowerCase() == "checkbox") {
                            objs[i].checked = true;
                        }
                    }
                }
                else {
                    for (var i = 0; i < objs.length; i++) {
                        if (objs[i].type.toLowerCase() == "checkbox") {
                            objs[i].checked = false;
                        }
                    }
                }
            },
            contains: function(star, end, isIgnoreCase) {
                if (isIgnoreCase) {
                    star = star.toLowerCase();
                    end = end.toLowerCase();
                }
                var startChar = end.substring(0, 1);
                var strLen = end.length;
                for (var j = 0; j < star.length - strLen + 1; j++) {
                    if (star.charAt(j) == startChar)//如果匹配起始字符,开始查找
                    {
                        if (star.substring(j, j + strLen) == end)//如果从j开始的字符与str匹配，那ok
                        {
                            return true;
                        }
                    }
                }
                return false;
            },
            gData: function(name, value) {
                var top = window.top, cache = top['_CACHE'] || {};
                top['_CACHE'] = cache;
                return value ? cache[name] = value : cache[name];
            },
            rData: function(name) {
                var cache = window.top['_CACHE'];
                if (cache && cache[name])
                    delete cache[name];
            }
        };

        function getAreaByPid(pid) {
            var result = [];
            area_data.forEach(function(v, i) {
                if (pid == v.pid) {
                    result.push(v)
                }
            })
            return result;
        }

        function getNextArea(obj) {
            var c = obj.data('id');
            var f = getAreaByPid(c);
            var g = '';
            for (var j = 0, clen = f.length; j < clen; j++) {
                g += '<a data-level="1" data-id="' + f[j]['id'] + '" data-name="' + f[j]['area'] + '" title="' + f[j]['area'] + '">' + f[j]['area'] + '</a>'
            }
            $("#_citysheng li").removeClass("citySel");
            $("#_citysheng li:eq(1)").addClass("citySel");
            return g;
        }

        var ths = obj;
        var dal = '<div class="_citys"><span title="关闭" id="cColse" >×</span><ul id="_citysheng" class="_citys0"><li class="citySel">省份</li><li>城市</li></ul><div id="_citys0" class="_citys1"></div><div style="display:none" id="_citys1" class="_citys1"></div></div>';
        Iput.show({id: ths, event: e, content: dal, width: "470"});
        $("#cColse").click(function() {
            Iput.colse();
            $(".b2b2c_layout").show();
        });
        var tb_province = [];
        var b = getAreaByPid(0);
        for (var i = 0, len = b.length; i < len; i++) {
            tb_province.push('<a data-level="0" data-id="' + b[i]['id'] + '" data-name="' + b[i]['area'] + '">' + b[i]['area'] + '</a>');
        }
        $("#_citys0").append(tb_province.join(""));
        $("#_citys0 a").click(function() {
            var g = getNextArea($(this));
            $("#_citys1 a").remove();
            $("#_citys1").append(g);
            $("._citys1").hide();
            $("._citys1:eq(1)").show();
            $("#_citys0 a,#_citys1 a").removeClass("AreaS");
            $(this).addClass("AreaS");
            var lev = $(this).data("name");
            ths.value = $(this).data("name");
            if (document.getElementById("hcity") == null) {
                var hcitys = $('<input>', {
                    type: 'hidden',
                    name: "hcity",
                    "data-id": $(this).data("id"),
                    id: "hcity",
                    val: lev
                });
                $(ths).after(hcitys);
            }
            else {
                $("#hcity").val(lev);
                $("#hcity").attr("data-id", $(this).data("id"));
            }
            $("#_citys1 a").click(function() {
                $(".b2b2c_layout").show();
                $("#_citys1 a").removeClass("AreaS");
                $(this).addClass("AreaS");
                var lev = $(this).data("name");

                if (document.getElementById("hproper") == null) {
                    var hcitys = $('<input>', {
                        type: 'hidden',
                        name: "hproper",
                        "data-id": $(this).data("id"),
                        id: "hproper",
                        val: lev
                    });
                    $(ths).after(hcitys);
                }
                else {
                    $("#hproper").attr("data-id", $(this).data("id"));
                    $("#hproper").val(lev);
                }
                var bc = $("#hcity").val();

                ths.value = bc + "-" + $(this).data("name");

                var ar = getNextArea($(this));

                $("._citys1").hide();
                $("._citys1:eq(2)").show();
                Iput.colse();

                if(callback){
                    callback($(this).data("id"));
                }

            });
        });
        $("#_citysheng li").click(function() {
            $("#_citysheng li").removeClass("citySel");
            $(this).addClass("citySel");
            var s = $("#_citysheng li").index(this);
            $("._citys1").hide();
            $("._citys1:eq(" + s + ")").show();
        });
        //滑到顶部
        $("html, body").scrollTop(0);
        $(".b2b2c_layout").hide();
    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 添加地址页面地区选择
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author wangdi Date:2017/1/13
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     *+--------------------------------------------------------------------------------------------------------------------
     * @parame String 必填obj,e
     *+--------------------------------------------------------------------------------------------------------------------
     * @parame String 选填样式(class="_citys0" 省，class="_citys1"市，class="_citys2"区)
     *+--------------------------------------------------------------------------------------------------------------------
     * @return String 选填地区id id="_citys0"省，id="_citys1"市，id="_citys2"区
     *+--------------------------------------------------------------------------------------------------------------------
     **/

    SelCity_add: function(obj, e, callback) {
        var area_data = areas.area_data;
        var Iput = {
            confg: {
                hand: "0", //0对像位置1鼠标位置divID滚动位置
                idIframe: "PoPx", //默认可不用改
                idBox: "PoPy", //默认可不用改
                content: "", //传过来的内容
                ok: null, //弹出框之后执行的函数
                id: null, //不能为空一般传this对像而不是对像ID
                event: window.event, //这个必写一般为e就可以了
                top: 0, //顶部偏移位置
                left: 0, //左部偏移位置
                bodyHeight: 0, //在被position:absolute元素下得到HTML真实高度
                bodyWidth: 0,
                width: 0,
                soll: null,
                pop: null //指定ID点击时不关闭
            },
            get: function(obj) {
                return document.getElementById(obj);
            },
            lft: function(e) {
                var l = 0;
                while (e) {
                    l += e.offsetLeft;
                    e = e.offsetParent;
                }
                return l
            },
            ltp: function(e) {
                var t = 0;
                while (e) {
                    t += e.offsetTop;
                    e = e.offsetParent;
                }
                return t
            },
            clear: function() {
                Iput.confg.hand = "0";
                Iput.confg.ok = null;
                Iput.confg.top = 0;
                Iput.confg.left = 0;
                Iput.confg.bodyHeight = 0;
                Iput.confg.bodyWidth = 0;
                Iput.confg.width = 0;
                Iput.confg.pop = null;
            },
            stopBubble: function(e) {
                if (e && e.stopPropagation) {
                    e.stopPropagation();    //w3c
                } else {
                    window.event.cancelBubble = true; //IE
                }
            },
            pop: function() {
                var $a = document.getElementsByTagName("body").item(0);
                var $c = document.createElement("iframe");
                var $b = document.createElement("div");
                $c.setAttribute('id', Iput.confg.idIframe);
                $c.setAttribute("src", "about:blank");
                $c.style.zindex = '100';
                $c.frameBorder = "0";
                $c.style.width = "0px";
                $c.style.height = "0px";
                $c.style.position = 'absolute';
                $b.setAttribute('id', Iput.confg.idBox);
                $b.setAttribute('align', 'left');
                $b.style.position = 'absolute';
                $b.style.background = '#fff';
                $b.style.zIndex = '20000';
                $b.style.height = document.body.offsetHeight + "px";
                if ($a) {
                    if (Iput.get(Iput.confg.idIframe)) {
                        Iput.colse();
                    }
                    $a.appendChild($c);
                    if ($c) {
                        $c.ownerDocument.body.appendChild($b);
                    }
                    Iput.get(Iput.confg.idBox).innerHTML = Iput.confg.content;
                    Iput.drice(Iput.confg.event);
                }

                if (!document.all) {
                    window.document.addEventListener("click", Iput.hide, false);
                }
                else {
                    window.document.attachEvent("onclick", Iput.hide);
                }
            },
            drice: function(e) {
                var bodyHith = Iput.confg.bodyHeight == 0 ? document.body.scrollHeight : Iput.confg.bodyHeight;
                var bodywidth = Iput.confg.bodyWidth == 0 ? document.body.scrollWidth : Iput.confg.bodyWidth;
                if (!e)
                    e = window.event;
                var top = 0, left = 0;
                var a = Iput.get(Iput.confg.idBox);
                var b = Iput.get(Iput.confg.idIframe);
                var c = Iput.confg.id.offsetHeight;
                var d = Iput.confg.id.offsetWidth;
                var w = 0;
                var st = 0;
                var sl = 0;
                if (Iput.confg.soll != null) {
                    st = document.getElementById(Iput.confg.soll).scrollTop;
                    sl = document.getElementById(Iput.confg.soll).scrollLeft;
                }
                if (Iput.get(Iput.confg.idIframe)) {
                    if (Iput.confg.hand == "1") {
                        top = Iput.confg.top + document.body.scrollTop + document.documentElement.scrollTop + e.clientY;
                        left = Iput.confg.left + e.clientX + document.body.scrollLeft + document.documentElement.scrollLeft;
                        if (a.offsetHeight + top > bodyHith) {
                            top = top - a.offsetHeight + Iput.get(Iput.confg.idBox).firstChild.offsetHeight;
                        }
                        if (a.offsetWidth + left > bodywidth) {
                            left = left - a.offsetWidth + Iput.get(Iput.confg.idBox).firstChild.offsetWidth;
                        }
                        a.style.top = 0;
                        // a.style.top = top - st + "px";
                        b.style.top = top - st + "px";
                        a.style.left = 0;
                        b.style.left = left - sl + "px";
                    }
                    else if (Iput.confg.hand == "0") {
                        w = Iput.confg.id.offsetWidth + "px";
                        n = document.body.offsetWidth + "px";
                        a.style.width = n;
                        b.style.width = w;
                        height = c;
                        top = Iput.confg.top + Iput.ltp(Iput.confg.id);
                        left = Iput.confg.left + Iput.lft(Iput.confg.id);
                        if (a.firstChild.offsetHeight + top + c > bodyHith) {
                            top = top - a.firstChild.offsetHeight - c;
                        }
                        if (a.firstChild.offsetWidth + left > bodywidth) {
                            left = left - a.firstChild.offsetWidth + d;
                        }
                        b.style.top = top - st + "px";
                        a.style.top = 0;
                        b.style.left = left - sl + "px";
                        a.style.left = 0;
                    }
                    else {
                        height = c;
                        top = Iput.confg.top - Iput.get(Iput.confg.hand).scrollTop + Iput.ltp(Iput.confg.id);
                        left = Iput.confg.left - Iput.get(Iput.confg.hand).scrollLeft + Iput.lft(Iput.confg.id);

                        if (a.offsetHeight + top > bodyHith) {
                            top = top - a.offsetHeight - c;
                        }
                        if (a.offsetWidth + left > bodywidth) {
                            left = left - a.offsetWidth - d;
                        }

                        b.style.top = top - st + height + "px";
                        a.style.top = 0;
                        // a.style.top = top - st + height + "px";
                        b.style.left = left - sl + "px";
                        // a.style.left = left - sl + "px";
                        a.style.left = 0;
                    }
                }
            },
            show: function() {
                var config = arguments[0];
                var that = Iput.confg;
                Iput.clear();
                for (var i in that) {
                    if (config[i] != undefined) {
                        that[i] = config[i];
                    }
                }
                ;
                Iput.pop();
                if (Iput.confg.ok != null) {
                    Iput.action(Iput.confg.ok());
                }
            },
            colse: function() {
                if (Iput.get(Iput.confg.idIframe)) {
                    document.body.removeChild(Iput.get(Iput.confg.idBox));
                    document.body.removeChild(Iput.get(Iput.confg.idIframe));
                }
                if (Iput.get(Iput.confg.pop)) {
                    Iput.get(Iput.confg.pop).style.display = "none";
                }
            },
            hide: function(e) {//点击任何处关闭层
                e = window.event || e;
                var srcElement = e.srcElement || e.target;
                if (Iput.confg.event == undefined) {//输入时用,般在没传入Iput.confg.event请况下使用
                    Iput.colse();
                }
                else {
                    var a = Iput.confg.event.srcElement || Iput.confg.event.target;
                    var b = Iput.get(Iput.confg.pop);
                    if (a != srcElement) {
                        Iput.colse();
                    }
                    if (b != null) {
                        if (b != srcElement && a != srcElement) {
                            Iput.colse();
                        }
                    }
                }
                if (Iput.get(Iput.confg.idIframe)) {
                    Iput.get(Iput.confg.idIframe).onclick = function(e) {
                        Iput.stopBubble(e);
                    };
                    Iput.get(Iput.confg.idBox).onclick = function(e) {
                        Iput.stopBubble(e);
                    };
                }
                if (Iput.get(Iput.confg.pop)) {
                    Iput.get(Iput.confg.pop).onclick = function(e) {
                        Iput.stopBubble(e);
                    };
                }

            },
            action: function(obj) {
                eval(obj);
            },
            cookie: {
                Set: function(name, val) {
                    var Days = 30;                          //此 cookie 将被保存 30 天
                    var exp = new Date();                  //new Date("December 31, 9998");
                    exp.setTime(exp.getTime() + Days * 24 * 60 * 60 * 1000);
                    document.cookie = name + "=" + escape(val) + ";expires=" + exp.toGMTString() + "; path=/";
                },
                Get: function(name) {
                    var start = document.cookie.indexOf(name);
                    var end = document.cookie.indexOf(";", start);
                    return start == -1 ? null : unescape(document.cookie.substring(start + name.length + 1, (end > start ? end : document.cookie.length)));
                },
                Del: function(name) {
                    var exp = new Date();
                    exp.setTime(exp.getTime() - 1);
                    var cval = this.GetCookie(name);
                    if (cval != null)
                        document.cookie = name + "=" + cval + ";expires=" + exp.toGMTString();
                }
            },
            ischeck: function(bol) {
                var objs = form1.getElementsByTagName("input");
                if (bol) {
                    for (var i = 0; i < objs.length; i++) {
                        if (objs[i].type.toLowerCase() == "checkbox") {
                            objs[i].checked = true;
                        }
                    }
                }
                else {
                    for (var i = 0; i < objs.length; i++) {
                        if (objs[i].type.toLowerCase() == "checkbox") {
                            objs[i].checked = false;
                        }
                    }
                }
            },
            contains: function(star, end, isIgnoreCase) {
                if (isIgnoreCase) {
                    star = star.toLowerCase();
                    end = end.toLowerCase();
                }
                var startChar = end.substring(0, 1);
                var strLen = end.length;
                for (var j = 0; j < star.length - strLen + 1; j++) {
                    if (star.charAt(j) == startChar)//如果匹配起始字符,开始查找
                    {
                        if (star.substring(j, j + strLen) == end)//如果从j开始的字符与str匹配，那ok
                        {
                            return true;
                        }
                    }
                }
                return false;
            },
            gData: function(name, value) {
                var top = window.top, cache = top['_CACHE'] || {};
                top['_CACHE'] = cache;
                return value ? cache[name] = value : cache[name];
            },
            rData: function(name) {
                var cache = window.top['_CACHE'];
                if (cache && cache[name])
                    delete cache[name];
            }
        };

        function getAreaByPid(pid) {
            var result = [];
            area_data.forEach(function(v, i) {
                if (pid == v.pid) {
                    result.push(v)
                }
            })
            return result;
        }

        function getNextArea(obj) {
            var c = obj.data('id');
            var f = getAreaByPid(c);
            var g = '';
            for (var j = 0, clen = f.length; j < clen; j++) {
                g += '<a data-level="1" data-id="' + f[j]['id'] + '" data-name="' + f[j]['area'] + '" title="' + f[j]['area'] + '">' + f[j]['area'] + '</a>'
            }
            $("#_citysheng li").removeClass("citySel");
            $("#_citysheng li:eq(1)").addClass("citySel");
            return g;
        }

        var ths = obj;
        var dal = '<div class="_citys"><span title="关闭" id="cColse" >×</span><ul id="_citysheng" class="_citys0"><li class="citySel">省份</li><li>城市</li><li>区县</li></ul><div id="_citys0" class="_citys1"></div><div style="display:none" id="_citys1" class="_citys1"></div><div style="display:none" id="_citys2" class="_citys1"></div></div>';
        Iput.show({id: ths, event: e, content: dal, width: "470"});
        $("#cColse").click(function() {
            Iput.colse();
            $(".b2b2c_layout").show();
        });
        var tb_province = [];
        var b = getAreaByPid(0);
        for (var i = 0, len = b.length; i < len; i++) {
            tb_province.push('<a data-level="0" data-id="' + b[i]['id'] + '" data-name="' + b[i]['area'] + '">' + b[i]['area'] + '</a>');
        }
        $("#_citys0").append(tb_province.join(""));
        $("#_citys0 a").click(function() {
            var g = getNextArea($(this));
            $("#_citys1 a").remove();
            $("#_citys1").append(g);
            $("._citys1").hide();
            $("._citys1:eq(1)").show();
            $("#_citys0 a,#_citys1 a").removeClass("AreaS");
            $(this).addClass("AreaS");
            var lev = $(this).data("name");
            ths.value = $(this).data("name");
            if (document.getElementById("hcity") == null) {
                var hcitys = $('<input>', {
                    type: 'hidden',
                    name: "hcity",
                    "data-id": $(this).data("id"),
                    id: "hcity",
                    val: lev
                });
                $(ths).after(hcitys);
            }
            else {
                $("#hcity").val(lev);
                $("#hcity").attr("data-id", $(this).data("id"));
            }
            $("#_citys1 a").click(function() {
                var g = getNextArea($(this));
                $("#_citys1 a").removeClass("AreaS");
                $(this).addClass("AreaS");
                $("#_citys2 a").remove();
                $("#_citys2").append(g);
                // $("._citys1").hide();
                // $("._citys2:eq(1)").show();
                // $("#_citys0 a,#_citys2 a").removeClass("AreaS");

                var lev = $(this).data("name");

                if (document.getElementById("hproper") == null) {
                    var hcitys = $('<input>', {
                        type: 'hidden',
                        name: "hproper",
                        "data-id": $(this).data("id"),
                        id: "hproper",
                        val: lev
                    });
                    $(ths).after(hcitys);
                }
                else {
                    $("#hproper").attr("data-id", $(this).data("id"));
                    $("#hproper").val(lev);
                }
                var bc = $("#hcity").val();

                ths.value = bc + "-" + $(this).data("name");

                var ar = getNextArea($(this));

                $("._citys1").hide();
                $("._citys1:eq(2)").show();

                if(callback){
                    callback($(this).data("id"));
                }

                $("#_citys2 a").click(function() {
                    $(".b2b2c_layout").show();
                    $("#_citys1 a").removeClass("AreaS");
                    $(this).addClass("AreaS");
                    var lev = $(this).data("name");

                    if (document.getElementById("hpropers") == null) {
                        var hcitys = $('<input>', {
                            type: 'hidden',
                            name: "hpropers",
                            "data-id": $(this).data("id"),
                            id: "hpropers",
                            val: lev
                        });
                        $(ths).after(hcitys);
                    }
                    else {
                        $("#hpropers").attr("data-id", $(this).data("id"));
                        $("#hpropers").val(lev);
                    }
                    var bc = $("#hcity").val();
                    var bd = $("#hproper").val();
                    ths.value = bc + "-" + bd + "-" + $(this).data("name");

                    var ar = getNextArea($(this));

                    $("._citys1").hide();
                    $("._citys1:eq(3)").show();
                    Iput.colse();

                    if(callback){
                        callback($(this).data("id"));
                    }

                });

            });
        });
        $("#_citysheng li").click(function() {
            $("#_citysheng li").removeClass("citySel");
            $(this).addClass("citySel");
            var s = $("#_citysheng li").index(this);
            $("._citys1").hide();
            $("._citys1:eq(" + s + ")").show();
        });
        //滑到顶部
        $("html, body").scrollTop(0);
        $(".b2b2c_layout").hide();
    },


    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 评论打分
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author wanghaipeng   Date:2016/8/5
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type post
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame Int 必填  $user_id    用户id
     *+--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    star_choice: function(t) {
        $(t).nextAll('i').removeClass('prepare_full').addClass('prepare_grade');
        if ($(t).hasClass('prepare_full')) {
            //$(t).removeClass('prepare_full').addClass('prepare_grade');
        } else {
            $(t).addClass('prepare_full').prevAll('i').addClass('prepare_full');
        }
    },
    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 评论选择图片
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author zhangnan   Date:2016/12/26
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type get
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame Object 必填  $thisObj    选择的元素
     *+--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    comments_show_image_upload_div: function(thisObj) {
        var index = $(thisObj).parent().data('index');
        $('#b2b2c_comment_image_index').val(index);
        $('#b2b2c_buyer_comment_upload_image_div').show();
        $('#b2b2c_buyer_comment_main_div').hide();

    },
    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 评论取消选择图片
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author zhangnan   Date:2016/12/26
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type get
     * +--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    comments_hide_image_upload_div: function() {
        $('#b2b2c_buyer_comment_upload_image_div').hide();
        $('#b2b2c_buyer_comment_main_div').show();

    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 评论打分
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author wanghaipeng   Date:2016/8/5
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type post
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame Int 必填  $user_id    用户id
     *+--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    comments_image_upload: function(t) {
        var post_data = {};
        post_data.image = $('input[name="image"]').val();
        b2b2cc.curls('B2b2cPrivate/BuyerCommentImagePost', post_data, function(data) {
            console.log(data);
            if (data.status) {
                var data = data.data;
                var index = $('#b2b2c_comment_image_index').val();
                var target = $('.b2b2c_img_box[data-index="'+index+'"]');
                target.find('img').attr('src', data.url);
                target.find('input[name="image_key"]').val(data.key);
                b2b2cf.comments_hide_image_upload_div();
            }
        }, 'post');

    },
    comments_image_refresh: function(t) {
        $(t).parents('.img_box').find('a input[name="b2b2c_comments_file"]').click();
    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 评论打分
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author zhangnan   Date:2016/12/26
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type post
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame Int 必填  shop_id    店铺id
     * @parame Int 必填  goods_id    商品id
     * @parame Int 必填  product_id    规格id
     * @parame Int 必填  order_id    订单id
     *+--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    make_comments: function(shop_id, goods_id, product_id, order_id) {
        var data = {};
        data.shop_id = shop_id;
        data.goods_id = goods_id;
        data.product_id = product_id;
        data.order_id = order_id;
        data.point = $('.prepare_grade_box .prepare_full').length;
        data.content = $('.b2b2c_product_evaluation_content_box textarea').val();
        if (data.point == 0) {
            b2b2cc.popupdialog('请对商品进行评分');
            return false;
        }
        var imgstr = '';
        $('.b2b2c_product_evaluation_img input[name="image_key"]').each(function(i) {
            if (i == 0) {
                imgstr += $(this).val();
            } else {
                if (!b2b2cc.isNull($(this).val())) {
                    imgstr += ',' + $(this).val();
                }
            }
        });
        if (data.content == '' && imgstr.length == 0) {
            b2b2cc.popupdialog('请对商品进行评价');
            return false;
        }
        data.images = imgstr;
        b2b2cc.curls('B2b2cPrivate/BuyerCommentPost', data, function(data) {
            if (data.status) {
                b2b2cc.popupdialog('添加成功');
                window.location.href = GV.MODULE_URL + 'User/order_manage';
            } else {
                b2b2cc.popupdialog(data.info);
            }
        }, 'post');
    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 商品发布、编辑 主图删除
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author wanghaipeng   Date:2016/9/14
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type
     * +--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    comments_image_del: function(t) {
        var target = $(t).parents('.img_box');
        var key_val = target.find('a input[name="image_key"]').val();
        b2b2cc.curls('Files/Del', {key: key_val}, function(data) {
            if (data.status) {
                target.find('a input[name="image_key"]').val('');
                target.find('a img').attr('src', '');
                target.find('.shade_del').hide()
            } else {
                b2b2cc.popupdialog(data.info);
            }
        }, 'get');
    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 订单详情页，点击商品跳转到商品详情页
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author zhangnan   Date:2017/1/4
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame Int 必填 goods_id 商品ID
     *+--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    order_detail_jump_to_goods_detail : function(goods_id){
        window.location.href = GV.MODULE_URL + 'Index/goodspointinfo/goods_id/' + goods_id;
    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 首页点击商品二级分类
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author zhangnan   Date:2016/12/26
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame Object 必填 thisObj 选中的页面
     *+--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    index_type_level_2_select : function(thisObj){
        var type = $('.b2b2c_nav_level_1.active').data('id');
        var type_level_2 = $(thisObj).data('id');

        window.location.href = GV.MODULE_URL + 'Index/goods_list/type/' + type + '/type_level_2/' + type_level_2;
    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 首页点击搜索框跳转到列表页
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author wangdi   Date:2017/1/12
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame Object 必填 thisObj 选中的页面
     *+--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
     **/
    index_type_list_select : function(thisObj){
        var type = $('.b2b2c_nav_level_1').data('id');
        window.location.href = GV.MODULE_URL + 'Index/goods_list/type/' + type;
    },


    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 订单确认--选择是否需要发票
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author zhangnan   Date:2016/12/28
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame Object 必填 thisObj 选中的元素
     *+--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    order_confirm_switch_invoice : function(thisObj){
        var target = $(thisObj).parents('section.b2b2c_invoice').hide().siblings('section.b2b2c_invoice').eq(0);
        $('input[name="b2b2c_invoice_input"]').val(target.find('input').eq(0).val());
        target.show();
    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 订单确认--选择是否发票类型，个人还是公司
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author zhangnan   Date:2016/12/28
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame Object 必填 thisObj 选中的元素
     *+--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    order_confirm_invoice_type : function(thisObj){
        $('input[name="b2b2c_invoice_status"]').val($(thisObj).data('val'));
        $(thisObj).addClass('active').siblings('input').removeClass('active');
    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 订单确认--显示更换地址的页面
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author zhangnan   Date:2016/12/28
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type
     * +--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    order_confirm_change_address : function(){
        $('main.b2b2c_order_submit_lay').hide().siblings('main#b2b2c_order_confirm_address_list').show();
        $('footer.b2b2c_order_submit_f').hide();
        $('footer.b2b2c_add_address').show();
    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 订单确认--添加新地址的页面
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author zhangnan   Date:2017/1/3
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type
     * +--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    order_confirm_add_address : function(){
        $('main, footer').hide();
        $('section.b2b2c_add_new_address').show();
        $('footer.b2b2c_add_new_address_submit').show();
    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 订单确认--添加新地址提交
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author zhangnan   Date:2017/1/3
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame String 选填 url 成功时的跳转地址
     *+--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    order_confirm_add_address_submit : function(url){
        var post_data = {};
        post_data.name = $('input[name="name"]').val();
        if (b2b2cc.isNull(post_data.name)) {
            b2b2cc.popupdialog('收货人姓名不能为空');
            return false;
        }

        post_data.tel = $('input[name="tel"]').val();
        if (b2b2cc.isNull(post_data.tel)) {
            b2b2cc.popupdialog('手机号码不能为空');
            return false;
        }
        var rs = b2b2cc.telno(post_data.tel);
        if (!rs.success) {
            b2b2cc.popupdialog('手机号码格式不正确');
            return false;
        }

        post_data.area = $('input[name="area_id"]').val();
        if (b2b2cc.isNull(post_data.area)) {
            b2b2cc.popupdialog('地区不能为空');
            return false;
        }

        post_data.address = $('textarea[name="address"]').val();
        if (b2b2cc.isNull(post_data.address)) {
            b2b2cc.popupdialog('地址不能为空');
            return false;
        }

        post_data.zip = $('input[name="zip"]').val();
        if (b2b2cc.isNull(post_data.zip)) {
            b2b2cc.popupdialog('邮政编码不能为空');
            return false;
        }
        if (!b2b2cc.checkZipCode(post_data.zip)) {
            b2b2cc.popupdialog('请正确填写邮政编码');
            return false;
        }

        post_data.is_default = $('input[name="is_default"]').val();

        b2b2cc.show_marsk();
        b2b2cc.curls('B2b2cPrivate/AddressBuyersAdd', post_data, function(data) {
            b2b2cc.close_marsk();
            if (data.status) {
                b2b2cc.popupdialog('添加成功！');

                if(!b2b2cc.isNull(url)){
                    window.location.href = GV.MODULE_URL + url + '/logis_model_id/' + data.data.id;
                }

            } else {
                b2b2cc.popupdialog(data.info);
            }
        }, 'post');
    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 订单确认(从立即购买过来)--选择一个地址
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author zhangnan   Date:2016/12/28
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame Object 必填 thisObj 选中的元素
     *+--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    order_confirm_address_selected : function(thisObj){
        var product_id = $('#b2b2c_order_confirm_product_id').val();
        var product_count = $('#b2b2c_order_confirm_product_count').val();
        var url = GV.MODULE_URL + 'User/order_confirm_goodsdetail' + '/product_id/' + product_id + "/logis_model_id/" + $(thisObj).data('id') + "/product_count/" + product_count;
        window.location.href = url;
    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 订单确认(从购物车过来)--选择一个地址
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author zhangnan   Date:2016/12/28
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame Object 必填 thisObj 选中的元素
     *+--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    order_confirm_cart_address_selected : function(thisObj){
        var cart_id = $('#b2b2c_cart_id').val();
        var url = GV.MODULE_URL + 'User/order_confirm' + '/b2b2c_cart_id/' + cart_id + "/logis_model_id/" + $(thisObj).data('id');
        window.location.href = url;
    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 商品详情，点击查看大图
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author zhangnan   Date:2017/1/5
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame Object 必填 thisObj 选中的元素
     *+--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    goods_info_image_full : function(thisObj){
        var src = $(thisObj).attr('src');
        var body_width = $('body').css('width');
        var body_height = $('body').css('height');
        $('#b2b2c_image_full_div img').attr('src', src).css('width', body_width);
        $('#b2b2c_image_full_div').css('height', body_height).show();
        window.location.href = "#b2b2c_image_full_div";

        //评论大图滑到顶部
        $("html, body").scrollTop(0);
        // 禁止页面滑动
        $('#b2b2c_image_full_div').bind("touchmove",function(e){
            e.preventDefault();
        });
    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 商品详情，取消显示大图
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author zhangnan   Date:2017/1/5
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type
     * +--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    goods_info_image_normal : function(){
        $('#b2b2c_image_full_div img').attr('src', '').css('width', 0);
        $('#b2b2c_image_full_div').css('height', 0).hide();
    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 订单确认提交
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author zhangnan   Date:2016/12/29
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type post
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame 
     *+--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
     **/
    submit_order: function(cat_id, address_id) {
        var shop_list = [];
//        var user_address_id = $('.receipt_list_address input[type="radio"]:checked').val();
//        if (b2b2cc.isNull(user_address_id)) {
//            b2b2cc.popupdialog('请选择收货地址');
//            return;
//        }
        var is_checked = $('input[name="b2b2c_invoice_input"]').val();
        var company = $('input[name="invoicemarks"]').val();
        var invoice_type = $('input[name="b2b2c_invoice_status"]').val();
        if ((is_checked == 1) && (invoice_type == 0)) {
            b2b2cc.popupdialog('请选择发票种类');
            return;
        }
        if ((is_checked == 1) && (company.length == 0)) {
            b2b2cc.popupdialog('请填写发票抬头');
            return;
        }
        var invoice_info = {};
        invoice_info.type = 0;
        invoice_info.company = '';
        if (invoice_type != 0 && is_checked) {
            invoice_info.type = invoice_type;
            invoice_info.company = company;
        }
        var url = GV.MODULE_URL + 'User/submit_order';
        var param = {};
        param.objids = cat_id;
        param.user_address_id = address_id;
        param.invoice_info = invoice_info;
        $.post(url, param, function(data) {
            if (data.status) {
                window.location.href = GV.MODULE_URL + 'Pay/applypay/sn/' + data.data.sn;
            } else {
                b2b2cc.popupdialog(data.info);
                window.location.href = document.referrer
//                window.location.href = GV.MODULE_URL + 'User/get_cart_list';
            }
        }, 'json');
    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 选择支付方式 --- 支付宝
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author zhangnan   Date:2016/12/29
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type post
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame 
     *+--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
     **/
    applypay_select_alipay : function(thisObj){
        $(thisObj).addClass('active').siblings('input').removeClass('active');
        $('section.b2b2c_order_bank_card').hide();
        $('.b2b2c_order_payment_method input[name="pay_type"]').val(1);
    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 选择支付方式 --- 银联
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author zhangnan   Date:2016/12/29
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type post
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame 
     *+--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
     **/
    applypay_select_unionpay : function(thisObj){
        $(thisObj).addClass('active').siblings('input').removeClass('active');
        $('section.b2b2c_order_bank_card').show();
        $('.b2b2c_order_payment_method input[name="pay_type"]').val(2);
    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 选择支付方式 --- 模拟支付
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author zhangnan   Date:2016/12/29
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type post
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame 
     *+--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
     **/
    applypay_select_testpay : function(thisObj){
        $(thisObj).addClass('active').siblings('input').removeClass('active');
        $('section.b2b2c_order_bank_card').hide();
        $('.b2b2c_order_payment_method input[name="pay_type"]').val(8);
    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 选择支付方式 --- 确认支付
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author zhangnan   Date:2016/12/29
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type post
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame 
     *+--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
     **/
    applypay_submit : function(){
        $('#b2b2c_applypay_form').submit();
    },

	/**
     *+--------------------------------------------------------------------------------------------------------------------
     * 订单管理拼接订单列表html
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author  liwenxuan  Date:2016/12/24
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type get
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame 
     *+--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
   **/
    get_cart_list_checkbox : function(obj, evt) {
		if($(obj).attr('id') == 'quanxuan') {
			if($(obj).is(':checked')) {
				$('input[type="checkbox"][disabled !="disabled"]').prop('checked', true);
			} else {
				$('input[type="checkbox"]').prop('checked', false);
			}
		} else if($(obj).attr('id') > 0) {
			if($(obj).is(':checked')) { 
				$('input[type ="checkbox"][disabled !="disabled"].b2b2c_checkbox_'+$(obj).attr('id')).prop('checked', true);
			} else {
				$('.b2b2c_checkbox_'+$(obj).attr('id')).prop('checked', false);
			}
		}
		
		var product_sum = 0;
		var product_money_sum = 0;
		$('input:checkbox[name="goodsinput"]:checked').each(function() {
			product_sum = product_sum + 1;
			product_money_sum = product_money_sum + parseFloat($(this).attr('data-product-sum'));
		});
		
		product_money_sum = product_money_sum.toFixed(1);

		$('#b2b2c_product_sum').html(product_sum);
		$('#b2b2c_product_money_sum').html(product_money_sum);

        var e=(evt)?evt:window.event;
        if (window.event) {
            e.cancelBubble=true;// ie下阻止冒泡
        } else {
            e.stopPropagation();// 其它浏览器下阻止冒泡
        }

        if (!$(obj).is(":checked")) {
            $("#quanxuan").prop('checked', false);//取消全选的选中状态
            $(obj).parents('.b2b2c_index_cart_inner_box').siblings('.b2b2c_shop_name').children('input').prop('checked', false);//取消店铺的选中状态
        }
        //所有店铺内商品选中后店铺按钮自动选中
        if($(obj).parents(".b2b2c_index_cart_inner_box").find("input[type='checkbox']:checked").length==$(obj).parents(".b2b2c_index_cart_inner_box").find("input[type='checkbox']").length){
            $(obj).parents(".b2b2c_index_cart_inner_box").siblings(".b2b2c_shop_name").find('input').prop('checked', true);
        };
        //所有商品选中后全选自动选中
        if($(".b2b2c_index_cart input[type='checkbox']:checked").length==$(".b2b2c_index_cart input[type='checkbox']").length){
            $("#quanxuan").prop('checked', true);
        };

    },

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 从购物车中删除指定的商品
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author yangjing   Date:2016/8/10
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     *+--------------------------------------------------------------------------------------------------------------------
     * @type get
     * +--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    cart_product_delete: function(id) {
        b2b2cc.popupdialoghtml('是否删除', function() {
            b2b2cc.curls('B2b2cPrivate/CartProductDelete', {'product_array': id}, function(data) {
                if (data.status) {
                    b2b2cc.popupdialog('删除成功！', 'User/get_cart_list');
                    window.location.reload();
                } else {
                    b2b2cc.popupdialog(data.info);
                }
            }, 'get');
        });
    },
	
    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 修改购物车的货品数量
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author yangjing   Date:2016/8/10
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type get
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame 
     *+--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    cart_product_count_edit: function(id, number) {
		b2b2cc.show_marsk();
        var data = {};
        data.product_id = id;
        data.count = number;
        b2b2cc.curls('B2b2cPrivate/CartProductCountEdit', data, function(data) {
            if (data.status) {
				window.location.reload();
            } else {
                b2b2cc.popupdialog(data.info);
            }
        }, 'get');
    },
    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 买家确认收货
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author wanghaipeng   Date:2016/8/5
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type post
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame Int 必填  $user_id    用户id
     *+--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    make_order_sure: function(order_id) {
        b2b2cc.popupdialoghtml('是否确认收货', function() {
            b2b2cc.curls('B2b2cPrivate/ConfirmReceipt', {order_id: order_id}, function(data) {

                if (data.status) {
                    b2b2cc.popupdialog('收货成功！');
                    window.location.reload();
                } else {
                    b2b2cc.popupdialog(data.info);
                }
            }, 'post');
        });
    },
	
    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 买家申请退款
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author wanghaipeng   Date:2016/9/20
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame Int 必填 order_id 订单id
     * +--------------------------------------------------------------------------------------------------------------------     
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    apply_order_refund: function(order_id) {
        b2b2cc.popupdialoghtml('是否确定申请退款', function(e) {
            b2b2cc.curls('B2b2cPrivate/ApplyOrderRefund', {id: order_id}, function(data) {
                if (data.status) {
                    b2b2cc.popupdialog('申请成功');
                    window.location.reload();
                } else {
                    b2b2cc.popupdialog('申请失败');
                }
            }, 'post');
        }, null);
    },
	
	/**
     *+--------------------------------------------------------------------------------------------------------------------
     * 规格选择数字
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author liwenxuan Date:2016/12/29
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame Int 必填 number 数字
     * +--------------------------------------------------------------------------------------------------------------------     
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    product_number: function(number) {

		number = parseInt(number);
		if(isNaN(number)) {
			number = 1;
		} else if(number > 99) {
			number = 99;
		} else if(number < 1) {
			number = 1;
		}
		
		$('#b2b2c_product_number').val(number);
		
	},
	
	/**
     *+--------------------------------------------------------------------------------------------------------------------
     *  商品编辑规格选择
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author liwenxuan Date:2016/12/29
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame 
     * +--------------------------------------------------------------------------------------------------------------------     
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    get_cart_list_edit_product: function() {
		
		var goods_id = $('#b2b2c_goods_id').val();
		var product_id = $('#b2b2c_product_id').val();
		var product_number = $('#b2b2c_product_number').val();
		
		b2b2cc.show_marsk();
        var post_data = {};

        var count = product_number;
        count = b2b2cc.parseInt(count, 1);
        if (count == 0) {
            count = 1;
        }
        post_data.count = count;
		post_data.product_id = product_id;
	
        b2b2cc.curls('B2b2cPrivate/CartProductAdd', post_data, function(e) {
           b2b2cc.close_marsk();
            if (e.status) {
                b2b2cc.popupdialog('添加成功！', 'User/get_cart_list_edit');
            } else {
                if (e.code == 10003) {
                    b2b2cc.popupdialog('请先登录', "Index/login");
                } else {
                    b2b2cc.popupdialog(e.info);
                }
            }
        }, 'get');
		
	},	

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 商品详情规格选择
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author zhangnan Date:2017/1/5
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame 
     * +--------------------------------------------------------------------------------------------------------------------     
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
    **/
    goods_info_select_product_callback: function() {
        
        var goods_id = $('#b2b2c_goods_id').val();
        var product_id = $('#b2b2c_product_id').val();
        var product_number = $('#b2b2c_product_number').val();

        var url = GV.MODULE_URL + 'Index/goodspointinfo/goods_id/' + goods_id;
        b2b2cf.goodstypelist_addcart(product_id, product_number, url);
    },  

    /**
     *+--------------------------------------------------------------------------------------------------------------------
     * 添加购物车
     *+--------------------------------------------------------------------------------------------------------------------
     * @Author zhangnan   Date:2017/1/5
     *+--------------------------------------------------------------------------------------------------------------------
     * @access public
     * +--------------------------------------------------------------------------------------------------------------------
     * @type GET
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame Int 必填 product_id 规格ID
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame Int 必填 count 数量
     * +--------------------------------------------------------------------------------------------------------------------
     * @parame String 选填 url 成功时的跳转地址
     * +--------------------------------------------------------------------------------------------------------------------
     * @return void
     * +--------------------------------------------------------------------------------------------------------------------
     **/
    goodstypelist_addcart: function(product_id, count, url) {
        b2b2cc.show_marsk();
        var post_data = {};

        count = b2b2cc.parseInt(count, 1);
        if (count == 0) {
            count = 1;
        }
        post_data.count = count;
        post_data.product_id = product_id;

        b2b2cc.curls('B2b2cPrivate/CartProductAdd', post_data, function(e) {
            b2b2cc.close_marsk();

            if (e.status) {
                b2b2cc.curls('B2b2cPrivate/GetCartCount', {}, function(e) {
                    if (e.status) {
                        b2b2cc.popupdialog('成功添加到购物车！');
                        window.location.href = url;
                    } else {
                        b2b2cc.popupdialog(e.info);
                    }
                }, 'get');

            } else {
                if (e.code == 10003) {
                    b2b2cc.popupdialog('请先登录', "Index/login");
                } else {
                    b2b2cc.popupdialog(e.info);
                }
            }
        }, 'get');
    },

}